Extensions/ИнтеграцияGreenApi/DataProcessors/iga_ОбработкаНастройкиИндивидуальныхШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>iga_ОбработкаНастройкиИндивидуальныхШаблонов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ШаблоныСообщенийПоВрачамИРаботам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ШаблоныСообщенийПоВрачамИРаботам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КартинкаШаблона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ДополнительныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АлгоритмПодготовки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ЯзыкиЧатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АлгоритмПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/DataProcessors/iga_ОбработкаНастройкиИндивидуальныхШаблонов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура НайтиШаблоныНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ШаблоныСообщенийПоВрачамИРаботам.Филиал КАК Филиал,
	               |	iga_ШаблоныСообщенийПоВрачамИРаботам.Врач КАК Врач,
	               |	iga_ШаблоныСообщенийПоВрачамИРаботам.Работа КАК Работа,
	               |	iga_ШаблоныСообщенийПоВрачамИРаботам.Язык КАК Язык,
	               |	iga_ШаблоныСообщенийПоВрачамИРаботам.АлгоритмПроверки КАК АлгоритмПроверки,
	               |	iga_ШаблоныСообщенийПоВрачамИРаботам.ШаблонСообщения КАК ШаблонСообщения
	               |ИЗ
	               |	РегистрСведений.iga_ШаблоныСообщенийПоВрачамИРаботам КАК iga_ШаблоныСообщенийПоВрачамИРаботам
	               |ГДЕ
	               |	iga_ШаблоныСообщенийПоВрачамИРаботам.ШаблонСообщения = &ШаблонСообщения";
	Запрос.УстановитьПараметр("ШаблонСообщения", ШаблонПоиска);
	Выборка = Запрос.Выполнить().Выбрать();
	ТаблицаНайденныхЗаписей.Очистить();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаНайденныхЗаписей.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиШаблоны(Команда)
	НайтиШаблоныНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПометку(Пометка, Таблица)
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		СтрокаТаблицы.Пометка = Пометка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометку(Команда)
	ИзменитьПометку(Истина, ТаблицаНайденныхЗаписей);
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометку(Команда)
	ИзменитьПометку(Ложь, ТаблицаНайденныхЗаписей);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьШаблонЗамены(Команда)
	
	Для Каждого СтрокаТаблицы Из ТаблицаНайденныхЗаписей Цикл
		Если Не СтрокаТаблицы.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы.ШаблонЗамены = ШаблонЗамены;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаменитьШаблоныВоВсехЗаписяхНаСервере()
	
	Для Каждого ЗаписьТаблицы Из ТаблицаНайденныхЗаписей Цикл
		
		Если Не ЗаписьТаблицы.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписьРегистра = РегистрыСведений.iga_ШаблоныСообщенийПоВрачамИРаботам.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьРегистра, ЗаписьТаблицы);
		ЗаписьРегистра.ШаблонСообщения = ЗаписьТаблицы.ШаблонЗамены;
		ЗаписьТаблицы.ШаблонСообщения = ЗаписьТаблицы.ШаблонЗамены;
		ЗаписьРегистра.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаменитьШаблоныВоВсехЗаписях(Команда)
	
	Ответ = Ждать ВопросАсинх("Выполнить замену в выбраных записях?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да,, КодВозвратаДиалога.Нет);
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаменитьШаблоныВоВсехЗаписяхНаСервере();
	
	ПредупреждениеАсинх("Операция завершена");
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаписейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеВыбораШаблона(ШаблонСообщения, ДопПараметры) Экспорт
	
	Если ШаблонСообщения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ШаблонПоиска = ШаблонСообщения;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПоискаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму(ИмяФормы + "ВыбораШаблона", Новый Структура("ШаблонСообщения", ШаблонПоиска),
		ЭтаФорма,,,, Новый ОписаниеОповещения("Обработчик_ПослеВыбораШаблона", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШаблоныНаСервере()
	
	ПШШаблоныРегистра.Очистить();
	ПШСвязанныеЗаписи.Очистить();
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	iga_ШаблоныСообщенийПоВрачамИРаботам.Филиал КАК Филиал,
		|	iga_ШаблоныСообщенийПоВрачамИРаботам.Врач КАК Врач,
		|	iga_ШаблоныСообщенийПоВрачамИРаботам.Работа КАК Работа,
		|	iga_ШаблоныСообщенийПоВрачамИРаботам.Язык КАК Язык,
		|	iga_ШаблоныСообщенийПоВрачамИРаботам.АлгоритмПроверки КАК АлгоритмПроверки,
		|	iga_ШаблоныСообщенийПоВрачамИРаботам.ШаблонСообщения КАК ШаблонСообщения,
		|	iga_ШаблоныСообщенийПоВрачамИРаботам.КартинкаШаблона КАК КартинкаШаблона,
		|	iga_ШаблоныСообщенийПоВрачамИРаботам.АлгоритмПодготовки КАК АлгоритмПодготовки
		|ИЗ
		|	РегистрСведений.iga_ШаблоныСообщенийПоВрачамИРаботам КАК iga_ШаблоныСообщенийПоВрачамИРаботам
		|ИТОГИ ПО
		|	ШаблонСообщения,
		|	Язык,
		|	АлгоритмПроверки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаШаблонСообщения = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаШаблонСообщения.Следующий() Цикл
		// Вставить обработку выборки ВыборкаШаблонСообщения
	
		ВыборкаЯзык = ВыборкаШаблонСообщения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаЯзык.Следующий() Цикл
			// Вставить обработку выборки ВыборкаЯзык
	
			ВыборкаАлгоритмПроверки = ВыборкаЯзык.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
			Пока ВыборкаАлгоритмПроверки.Следующий() Цикл
				// Вставить обработку выборки ВыборкаАлгоритмПроверки
				
				СтрокаШаблона = ПШШаблоныРегистра.Добавить();
				СтрокаШаблона.Шаблон = ВыборкаАлгоритмПроверки.ШаблонСообщения;
				СтрокаШаблона.Язык = ВыборкаАлгоритмПроверки.Язык;
				СтрокаШаблона.АлгоритмПроверки = ВыборкаАлгоритмПроверки.АлгоритмПроверки;
				СтрокаШаблона.КлючСвязи = Новый УникальныйИдентификатор;
				
				ВыборкаДетальныеЗаписи = ВыборкаАлгоритмПроверки.Выбрать();
	
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ЗаписьРегистра = ПШСвязанныеЗаписи.Добавить();
					ЗаполнитьЗначенияСвойств(ЗаписьРегистра, ВыборкаДетальныеЗаписи);
					ЗаписьРегистра.КлючСвязи = СтрокаШаблона.КлючСвязи;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьШаблоны(Команда)
	ЗаполнитьШаблоныНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныРегистраПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.ПШШаблоныРегистра.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		КлючСвязи = 0;
	Иначе 
		КлючСвязи = ТекущаяСтрока.КлючСвязи;		
	КонецЕсли;
	
	Элементы.ПШСвязанныеЗаписи.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("КлючСвязи", КлючСвязи));
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныРегистраПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.ПШШаблоныРегистра.ТекущиеДанные;
	
	НайденныеСТроки = ПШСвязанныеЗаписи.НайтиСтроки(Новый Структура("КлючСвязи", ТекущаяСтрока.КлючСвязи));
	
	Для Каждого СтрокаЗаписи Из НайденныеСТроки Цикл
		ПШСвязанныеЗаписи.Удалить(СтрокаЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПШСвязанныеЗаписиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элементы.ПШСвязанныеЗаписи.ТекущиеДанные.КлючСвязи = Элементы.ПШШаблоныРегистра.ТекущиеДанные.КлючСвязи;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПШСвязанныеЗаписиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.ПШШаблоныРегистра.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПШПрименитьНастройкиНаСервере()
	
	ТаблицаЗаписей = ПШСвязанныеЗаписи.Выгрузить();
	
	СтруктураПоиска = Новый Структура("КлючСвязи");
	
	Для Каждого ЗаписьРегистра Из ТаблицаЗаписей Цикл
		СтруктураПоиска.КлючСвязи = ЗаписьРегистра.КлючСвязи;
		НайденныеСтроки = ПШШаблоныРегистра.НайтиСтроки(СтруктураПоиска);
		ЗаполнитьЗначенияСвойств(ЗаписьРегистра, НайденныеСтроки[0]);
	КонецЦикла;
	
	ЗаписиРегистра = РегистрыСведений.iga_ШаблоныСообщенийПоВрачамИРаботам.СоздатьНаборЗаписей();
	ЗаписиРегистра.Загрузить(ТаблицаЗаписей);
	ЗаписиРегистра.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПШПрименитьНастройки(Команда)
	ПШПрименитьНастройкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПШШаблоныРегистраПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрока = Элементы.ПШШаблоныРегистра.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		ТекущаяСтрока.КлючСвязи = Новый УникальныйИдентификатор;
		
		Элементы.ПШСвязанныеЗаписи.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("КлючСвязи", ТекущаяСтрока.КлючСвязи));

	КонецЕсли;
	
КонецПроцедуры
